MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4680/mcu.h
// Register: RXF8SIDL
#define RXF8SIDL RXF8SIDL
extern volatile unsigned char           RXF8SIDL            __at(0xD69);
#ifndef _LIB_BUILD
asm("RXF8SIDL equ 0D69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXIDE                  :1;
    };
    struct {
        unsigned RXF8EID16              :1;
        unsigned RXF8EID17              :1;
        unsigned                        :1;
        unsigned RXF8EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF8SID0               :1;
        unsigned RXF8SID1               :1;
        unsigned RXF8SID2               :1;
    };
} RXF8SIDLbits_t;
extern volatile RXF8SIDLbits_t RXF8SIDLbits __at(0xD69);
// bitfield macros
#define _RXF8SIDL_EID16_POSN                                0x0
#define _RXF8SIDL_EID16_POSITION                            0x0
#define _RXF8SIDL_EID16_SIZE                                0x1
#define _RXF8SIDL_EID16_LENGTH                              0x1
#define _RXF8SIDL_EID16_MASK                                0x1
#define _RXF8SIDL_EID17_POSN                                0x1
#define _RXF8SIDL_EID17_POSITION                            0x1
#define _RXF8SIDL_EID17_SIZE                                0x1
#define _RXF8SIDL_EID17_LENGTH                              0x1
#define _RXF8SIDL_EID17_MASK                                0x2
#define _RXF8SIDL_EXIDEN_POSN                               0x3
#define _RXF8SIDL_EXIDEN_POSITION                           0x3
#define _RXF8SIDL_EXIDEN_SIZE                               0x1
#define _RXF8SIDL_EXIDEN_LENGTH                             0x1
#define _RXF8SIDL_EXIDEN_MASK                               0x8
#define _RXF8SIDL_SID0_POSN                                 0x5
#define _RXF8SIDL_SID0_POSITION                             0x5
#define _RXF8SIDL_SID0_SIZE                                 0x1
#define _RXF8SIDL_SID0_LENGTH                               0x1
#define _RXF8SIDL_SID0_MASK                                 0x20
#define _RXF8SIDL_SID1_POSN                                 0x6
#define _RXF8SIDL_SID1_POSITION                             0x6
#define _RXF8SIDL_SID1_SIZE                                 0x1
#define _RXF8SIDL_SID1_LENGTH                               0x1
#define _RXF8SIDL_SID1_MASK                                 0x40
#define _RXF8SIDL_SID2_POSN                                 0x7
#define _RXF8SIDL_SID2_POSITION                             0x7
#define _RXF8SIDL_SID2_SIZE                                 0x1
#define _RXF8SIDL_SID2_LENGTH                               0x1
#define _RXF8SIDL_SID2_MASK                                 0x80
#define _RXF8SIDL_EXIDE_POSN                                0x3
#define _RXF8SIDL_EXIDE_POSITION                            0x3
#define _RXF8SIDL_EXIDE_SIZE                                0x1
#define _RXF8SIDL_EXIDE_LENGTH                              0x1
#define _RXF8SIDL_EXIDE_MASK                                0x8
#define _RXF8SIDL_RXF8EID16_POSN                            0x0
#define _RXF8SIDL_RXF8EID16_POSITION                        0x0
#define _RXF8SIDL_RXF8EID16_SIZE                            0x1
#define _RXF8SIDL_RXF8EID16_LENGTH                          0x1
#define _RXF8SIDL_RXF8EID16_MASK                            0x1
#define _RXF8SIDL_RXF8EID17_POSN                            0x1
#define _RXF8SIDL_RXF8EID17_POSITION                        0x1
#define _RXF8SIDL_RXF8EID17_SIZE                            0x1
#define _RXF8SIDL_RXF8EID17_LENGTH                          0x1
#define _RXF8SIDL_RXF8EID17_MASK                            0x2
#define _RXF8SIDL_RXF8EXIDEN_POSN                           0x3
#define _RXF8SIDL_RXF8EXIDEN_POSITION                       0x3
#define _RXF8SIDL_RXF8EXIDEN_SIZE                           0x1
#define _RXF8SIDL_RXF8EXIDEN_LENGTH                         0x1
#define _RXF8SIDL_RXF8EXIDEN_MASK                           0x8
#define _RXF8SIDL_RXF8SID0_POSN                             0x5
#define _RXF8SIDL_RXF8SID0_POSITION                         0x5
#define _RXF8SIDL_RXF8SID0_SIZE                             0x1
#define _RXF8SIDL_RXF8SID0_LENGTH                           0x1
#define _RXF8SIDL_RXF8SID0_MASK                             0x20
#define _RXF8SIDL_RXF8SID1_POSN                             0x6
#define _RXF8SIDL_RXF8SID1_POSITION                         0x6
#define _RXF8SIDL_RXF8SID1_SIZE                             0x1
#define _RXF8SIDL_RXF8SID1_LENGTH                           0x1
#define _RXF8SIDL_RXF8SID1_MASK                             0x40
#define _RXF8SIDL_RXF8SID2_POSN                             0x7
#define _RXF8SIDL_RXF8SID2_POSITION                         0x7
#define _RXF8SIDL_RXF8SID2_SIZE                             0x1
#define _RXF8SIDL_RXF8SID2_LENGTH                           0x1
#define _RXF8SIDL_RXF8SID2_MASK                             0x80

// Register: RXF8EIDH
#define RXF8EIDH RXF8EIDH
extern volatile unsigned char           RXF8EIDH            __at(0xD6A);
#ifndef _LIB_BUILD
asm("RXF8EIDH equ 0D6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF8EID8               :1;
        unsigned RXF8EID9               :1;
        unsigned RXF8EID10              :1;
        unsigned RXF8EID11              :1;
        unsigned RXF8EID12              :1;
        unsigned RXF8EID13              :1;
        unsigned RXF8EID14              :1;
        unsigned RXF8EID15              :1;
    };
} RXF8EIDHbits_t;
extern volatile RXF8EIDHbits_t RXF8EIDHbits __at(0xD6A);
// bitfield macros
#define _RXF8EIDH_EID8_POSN                                 0x0
#define _RXF8EIDH_EID8_POSITION                             0x0
#define _RXF8EIDH_EID8_SIZE                                 0x1
#define _RXF8EIDH_EID8_LENGTH                               0x1
#define _RXF8EIDH_EID8_MASK                                 0x1
#define _RXF8EIDH_EID9_POSN                                 0x1
#define _RXF8EIDH_EID9_POSITION                             0x1
#define _RXF8EIDH_EID9_SIZE                                 0x1
#define _RXF8EIDH_EID9_LENGTH                               0x1
#define _RXF8EIDH_EID9_MASK                                 0x2
#define _RXF8EIDH_EID10_POSN                                0x2
#define _RXF8EIDH_EID10_POSITION                            0x2
#define _RXF8EIDH_EID10_SIZE                                0x1
#define _RXF8EIDH_EID10_LENGTH                              0x1
#define _RXF8EIDH_EID10_MASK                                0x4
#define _RXF8EIDH_EID11_POSN                                0x3
#define _RXF8EIDH_EID11_POSITION                            0x3
#define _RXF8EIDH_EID11_SIZE                                0x1
#define _RXF8EIDH_EID11_LENGTH                              0x1
#define _RXF8EIDH_EID11_MASK                                0x8
#define _RXF8EIDH_EID12_POSN                                0x4
#define _RXF8EIDH_EID12_POSITION                            0x4
#define _RXF8EIDH_EID12_SIZE                                0x1
#define _RXF8EIDH_EID12_LENGTH                              0x1
#define _RXF8EIDH_EID12_MASK                                0x10
#define _RXF8EIDH_EID13_POSN                                0x5
#define _RXF8EIDH_EID13_POSITION                            0x5
#define _RXF8EIDH_EID13_SIZE                                0x1
#define _RXF8EIDH_EID13_LENGTH                              0x1
#define _RXF8EIDH_EID13_MASK                                0x20
#define _RXF8EIDH_EID14_POSN                                0x6
#define _RXF8EIDH_EID14_POSITION                            0x6
#define _RXF8EIDH_EID14_SIZE                                0x1
#define _RXF8EIDH_EID14_LENGTH                              0x1
#define _RXF8EIDH_EID14_MASK                                0x40
#define _RXF8EIDH_EID15_POSN                                0x7
#define _RXF8EIDH_EID15_POSITION                            0x7
#define _RXF8EIDH_EID15_SIZE                                0x1
#define _RXF8EIDH_EID15_LENGTH                              0x1
#define _RXF8EIDH_EID15_MASK                                0x80
#define _RXF8EIDH_RXF8EID8_POSN                             0x0
#define _RXF8EIDH_RXF8EID8_POSITION                         0x0
#define _RXF8EIDH_RXF8EID8_SIZE                             0x1
#define _RXF8EIDH_RXF8EID8_LENGTH                           0x1
#define _RXF8EIDH_RXF8EID8_MASK                             0x1
#define _RXF8EIDH_RXF8EID9_POSN                             0x1
#define _RXF8EIDH_RXF8EID9_POSITION                         0x1
#define _RXF8EIDH_RXF8EID9_SIZE                             0x1
#define _RXF8EIDH_RXF8EID9_LENGTH                           0x1
#define _RXF8EIDH_RXF8EID9_MASK                             0x2
#define _RXF8EIDH_RXF8EID10_POSN                            0x2
#define _RXF8EIDH_RXF8EID10_POSITION                        0x2
#define _RXF8EIDH_RXF8EID10_SIZE                            0x1
#define _RXF8EIDH_RXF8EID10_LENGTH                          0x1
#define _RXF8EIDH_RXF8EID10_MASK                            0x4
#define _RXF8EIDH_RXF8EID11_POSN                            0x3
#define _RXF8EIDH_RXF8EID11_POSITION                        0x3
#define _RXF8EIDH_RXF8EID11_SIZE                            0x1
#define _RXF8EIDH_RXF8EID11_LENGTH                          0x1
#define _RXF8EIDH_RXF8EID11_MASK                            0x8
#define _RXF8EIDH_RXF8EID12_POSN                            0x4
#define _RXF8EIDH_RXF8EID12_POSITION                        0x4
#define _RXF8EIDH_RXF8EID12_SIZE                            0x1
#define _RXF8EIDH_RXF8EID12_LENGTH                          0x1
#define _RXF8EIDH_RXF8EID12_MASK                            0x10
#define _RXF8EIDH_RXF8EID13_POSN                            0x5
#define _RXF8EIDH_RXF8EID13_POSITION                        0x5
#define _RXF8EIDH_RXF8EID13_SIZE                            0x1
#define _RXF8EIDH_RXF8EID13_LENGTH                          0x1
#define _RXF8EIDH_RXF8EID13_MASK                            0x20
#define _RXF8EIDH_RXF8EID14_POSN                            0x6
#define _RXF8EIDH_RXF8EID14_POSITION                        0x6
#define _RXF8EIDH_RXF8EID14_SIZE                            0x1
#define _RXF8EIDH_RXF8EID14_LENGTH                          0x1
#define _RXF8EIDH_RXF8EID14_MASK                            0x40
#define _RXF8EIDH_RXF8EID15_POSN                            0x7
#define _RXF8EIDH_RXF8EID15_POSITION                        0x7
#define _RXF8EIDH_RXF8EID15_SIZE                            0x1
#define _RXF8EIDH_RXF8EID15_LENGTH                          0x1
#define _RXF8EIDH_RXF8EID15_MASK                            0x80

// Register: RXF8EIDL
#define RXF8EIDL RXF8EIDL
extern volatile unsigned char           RXF8EIDL            __at(0xD6B);
#ifndef _LIB_BUILD
asm("RXF8EIDL equ 0D6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF8EID0               :1;
        unsigned RXF8EID1               :1;
        unsigned RXF8EID2               :1;
        unsigned RXF8EID3               :1;
        unsigned RXF8EID4               :1;
        unsigned RXF8EID5               :1;
        unsigned RXF8EID6               :1;
        unsigned RXF8EID7               :1;
    };
} RXF8EIDLbits_t;
