MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4680/mcu.h
extern volatile B2EIDLbits_t B2EIDLbits __at(0xE44);
// bitfield macros
#define _B2EIDL_EID0_POSN                                   0x0
#define _B2EIDL_EID0_POSITION                               0x0
#define _B2EIDL_EID0_SIZE                                   0x1
#define _B2EIDL_EID0_LENGTH                                 0x1
#define _B2EIDL_EID0_MASK                                   0x1
#define _B2EIDL_EID1_POSN                                   0x1
#define _B2EIDL_EID1_POSITION                               0x1
#define _B2EIDL_EID1_SIZE                                   0x1
#define _B2EIDL_EID1_LENGTH                                 0x1
#define _B2EIDL_EID1_MASK                                   0x2
#define _B2EIDL_EID2_POSN                                   0x2
#define _B2EIDL_EID2_POSITION                               0x2
#define _B2EIDL_EID2_SIZE                                   0x1
#define _B2EIDL_EID2_LENGTH                                 0x1
#define _B2EIDL_EID2_MASK                                   0x4
#define _B2EIDL_EID3_POSN                                   0x3
#define _B2EIDL_EID3_POSITION                               0x3
#define _B2EIDL_EID3_SIZE                                   0x1
#define _B2EIDL_EID3_LENGTH                                 0x1
#define _B2EIDL_EID3_MASK                                   0x8
#define _B2EIDL_EID4_POSN                                   0x4
#define _B2EIDL_EID4_POSITION                               0x4
#define _B2EIDL_EID4_SIZE                                   0x1
#define _B2EIDL_EID4_LENGTH                                 0x1
#define _B2EIDL_EID4_MASK                                   0x10
#define _B2EIDL_EID5_POSN                                   0x5
#define _B2EIDL_EID5_POSITION                               0x5
#define _B2EIDL_EID5_SIZE                                   0x1
#define _B2EIDL_EID5_LENGTH                                 0x1
#define _B2EIDL_EID5_MASK                                   0x20
#define _B2EIDL_EID6_POSN                                   0x6
#define _B2EIDL_EID6_POSITION                               0x6
#define _B2EIDL_EID6_SIZE                                   0x1
#define _B2EIDL_EID6_LENGTH                                 0x1
#define _B2EIDL_EID6_MASK                                   0x40
#define _B2EIDL_EID7_POSN                                   0x7
#define _B2EIDL_EID7_POSITION                               0x7
#define _B2EIDL_EID7_SIZE                                   0x1
#define _B2EIDL_EID7_LENGTH                                 0x1
#define _B2EIDL_EID7_MASK                                   0x80
#define _B2EIDL_B2EID0_POSN                                 0x0
#define _B2EIDL_B2EID0_POSITION                             0x0
#define _B2EIDL_B2EID0_SIZE                                 0x1
#define _B2EIDL_B2EID0_LENGTH                               0x1
#define _B2EIDL_B2EID0_MASK                                 0x1
#define _B2EIDL_B2EID1_POSN                                 0x1
#define _B2EIDL_B2EID1_POSITION                             0x1
#define _B2EIDL_B2EID1_SIZE                                 0x1
#define _B2EIDL_B2EID1_LENGTH                               0x1
#define _B2EIDL_B2EID1_MASK                                 0x2
#define _B2EIDL_B2EID2_POSN                                 0x2
#define _B2EIDL_B2EID2_POSITION                             0x2
#define _B2EIDL_B2EID2_SIZE                                 0x1
#define _B2EIDL_B2EID2_LENGTH                               0x1
#define _B2EIDL_B2EID2_MASK                                 0x4
#define _B2EIDL_B2EID3_POSN                                 0x3
#define _B2EIDL_B2EID3_POSITION                             0x3
#define _B2EIDL_B2EID3_SIZE                                 0x1
#define _B2EIDL_B2EID3_LENGTH                               0x1
#define _B2EIDL_B2EID3_MASK                                 0x8
#define _B2EIDL_B2EID4_POSN                                 0x4
#define _B2EIDL_B2EID4_POSITION                             0x4
#define _B2EIDL_B2EID4_SIZE                                 0x1
#define _B2EIDL_B2EID4_LENGTH                               0x1
#define _B2EIDL_B2EID4_MASK                                 0x10
#define _B2EIDL_B2EID5_POSN                                 0x5
#define _B2EIDL_B2EID5_POSITION                             0x5
#define _B2EIDL_B2EID5_SIZE                                 0x1
#define _B2EIDL_B2EID5_LENGTH                               0x1
#define _B2EIDL_B2EID5_MASK                                 0x20
#define _B2EIDL_B2EID6_POSN                                 0x6
#define _B2EIDL_B2EID6_POSITION                             0x6
#define _B2EIDL_B2EID6_SIZE                                 0x1
#define _B2EIDL_B2EID6_LENGTH                               0x1
#define _B2EIDL_B2EID6_MASK                                 0x40
#define _B2EIDL_B2EID7_POSN                                 0x7
#define _B2EIDL_B2EID7_POSITION                             0x7
#define _B2EIDL_B2EID7_SIZE                                 0x1
#define _B2EIDL_B2EID7_LENGTH                               0x1
#define _B2EIDL_B2EID7_MASK                                 0x80

// Register: B2DLC
#define B2DLC B2DLC
extern volatile unsigned char           B2DLC               __at(0xE45);
#ifndef _LIB_BUILD
asm("B2DLC equ 0E45h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RXRTR_TXRTR            :1;
    };
    struct {
        unsigned                        :4;
        unsigned RESRB0                 :1;
        unsigned RESRB1                 :1;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned RXRTR                  :1;
    };
    struct {
        unsigned B2DLC0                 :1;
        unsigned B2DLC1                 :1;
        unsigned B2DLC2                 :1;
        unsigned B2DLC3                 :1;
        unsigned B2RB0                  :1;
        unsigned B2RB1                  :1;
        unsigned B2RXRTR                :1;
    };
} B2DLCbits_t;
