MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4680/mcu.h
extern volatile TXB2SIDHbits_t TXB2SIDHbits __at(0xF21);
// bitfield macros
#define _TXB2SIDH_SID3_POSN                                 0x0
#define _TXB2SIDH_SID3_POSITION                             0x0
#define _TXB2SIDH_SID3_SIZE                                 0x1
#define _TXB2SIDH_SID3_LENGTH                               0x1
#define _TXB2SIDH_SID3_MASK                                 0x1
#define _TXB2SIDH_SID4_POSN                                 0x1
#define _TXB2SIDH_SID4_POSITION                             0x1
#define _TXB2SIDH_SID4_SIZE                                 0x1
#define _TXB2SIDH_SID4_LENGTH                               0x1
#define _TXB2SIDH_SID4_MASK                                 0x2
#define _TXB2SIDH_SID5_POSN                                 0x2
#define _TXB2SIDH_SID5_POSITION                             0x2
#define _TXB2SIDH_SID5_SIZE                                 0x1
#define _TXB2SIDH_SID5_LENGTH                               0x1
#define _TXB2SIDH_SID5_MASK                                 0x4
#define _TXB2SIDH_SID6_POSN                                 0x3
#define _TXB2SIDH_SID6_POSITION                             0x3
#define _TXB2SIDH_SID6_SIZE                                 0x1
#define _TXB2SIDH_SID6_LENGTH                               0x1
#define _TXB2SIDH_SID6_MASK                                 0x8
#define _TXB2SIDH_SID7_POSN                                 0x4
#define _TXB2SIDH_SID7_POSITION                             0x4
#define _TXB2SIDH_SID7_SIZE                                 0x1
#define _TXB2SIDH_SID7_LENGTH                               0x1
#define _TXB2SIDH_SID7_MASK                                 0x10
#define _TXB2SIDH_SID8_POSN                                 0x5
#define _TXB2SIDH_SID8_POSITION                             0x5
#define _TXB2SIDH_SID8_SIZE                                 0x1
#define _TXB2SIDH_SID8_LENGTH                               0x1
#define _TXB2SIDH_SID8_MASK                                 0x20
#define _TXB2SIDH_SID9_POSN                                 0x6
#define _TXB2SIDH_SID9_POSITION                             0x6
#define _TXB2SIDH_SID9_SIZE                                 0x1
#define _TXB2SIDH_SID9_LENGTH                               0x1
#define _TXB2SIDH_SID9_MASK                                 0x40
#define _TXB2SIDH_SID10_POSN                                0x7
#define _TXB2SIDH_SID10_POSITION                            0x7
#define _TXB2SIDH_SID10_SIZE                                0x1
#define _TXB2SIDH_SID10_LENGTH                              0x1
#define _TXB2SIDH_SID10_MASK                                0x80
#define _TXB2SIDH_TXB2SID3_POSN                             0x0
#define _TXB2SIDH_TXB2SID3_POSITION                         0x0
#define _TXB2SIDH_TXB2SID3_SIZE                             0x1
#define _TXB2SIDH_TXB2SID3_LENGTH                           0x1
#define _TXB2SIDH_TXB2SID3_MASK                             0x1
#define _TXB2SIDH_TXB2SID4_POSN                             0x1
#define _TXB2SIDH_TXB2SID4_POSITION                         0x1
#define _TXB2SIDH_TXB2SID4_SIZE                             0x1
#define _TXB2SIDH_TXB2SID4_LENGTH                           0x1
#define _TXB2SIDH_TXB2SID4_MASK                             0x2
#define _TXB2SIDH_TXB2SID5_POSN                             0x2
#define _TXB2SIDH_TXB2SID5_POSITION                         0x2
#define _TXB2SIDH_TXB2SID5_SIZE                             0x1
#define _TXB2SIDH_TXB2SID5_LENGTH                           0x1
#define _TXB2SIDH_TXB2SID5_MASK                             0x4
#define _TXB2SIDH_TXB2SID6_POSN                             0x3
#define _TXB2SIDH_TXB2SID6_POSITION                         0x3
#define _TXB2SIDH_TXB2SID6_SIZE                             0x1
#define _TXB2SIDH_TXB2SID6_LENGTH                           0x1
#define _TXB2SIDH_TXB2SID6_MASK                             0x8
#define _TXB2SIDH_TXB2SID7_POSN                             0x4
#define _TXB2SIDH_TXB2SID7_POSITION                         0x4
#define _TXB2SIDH_TXB2SID7_SIZE                             0x1
#define _TXB2SIDH_TXB2SID7_LENGTH                           0x1
#define _TXB2SIDH_TXB2SID7_MASK                             0x10
#define _TXB2SIDH_TXB2SID8_POSN                             0x5
#define _TXB2SIDH_TXB2SID8_POSITION                         0x5
#define _TXB2SIDH_TXB2SID8_SIZE                             0x1
#define _TXB2SIDH_TXB2SID8_LENGTH                           0x1
#define _TXB2SIDH_TXB2SID8_MASK                             0x20
#define _TXB2SIDH_TXB2SID9_POSN                             0x6
#define _TXB2SIDH_TXB2SID9_POSITION                         0x6
#define _TXB2SIDH_TXB2SID9_SIZE                             0x1
#define _TXB2SIDH_TXB2SID9_LENGTH                           0x1
#define _TXB2SIDH_TXB2SID9_MASK                             0x40
#define _TXB2SIDH_TXB2SID10_POSN                            0x7
#define _TXB2SIDH_TXB2SID10_POSITION                        0x7
#define _TXB2SIDH_TXB2SID10_SIZE                            0x1
#define _TXB2SIDH_TXB2SID10_LENGTH                          0x1
#define _TXB2SIDH_TXB2SID10_MASK                            0x80

// Register: TXB2SIDL
#define TXB2SIDL TXB2SIDL
extern volatile unsigned char           TXB2SIDL            __at(0xF22);
#ifndef _LIB_BUILD
asm("TXB2SIDL equ 0F22h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDE                  :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned TXB2EID16              :1;
        unsigned TXB2EID17              :1;
        unsigned                        :1;
        unsigned TXB2EXIDE              :1;
        unsigned                        :1;
        unsigned TXB2SID0               :1;
        unsigned TXB2SID1               :1;
        unsigned TXB2SID2               :1;
    };
} TXB2SIDLbits_t;
extern volatile TXB2SIDLbits_t TXB2SIDLbits __at(0xF22);
// bitfield macros
#define _TXB2SIDL_EID16_POSN                                0x0
#define _TXB2SIDL_EID16_POSITION                            0x0
#define _TXB2SIDL_EID16_SIZE                                0x1
#define _TXB2SIDL_EID16_LENGTH                              0x1
#define _TXB2SIDL_EID16_MASK                                0x1
#define _TXB2SIDL_EID17_POSN                                0x1
#define _TXB2SIDL_EID17_POSITION                            0x1
#define _TXB2SIDL_EID17_SIZE                                0x1
#define _TXB2SIDL_EID17_LENGTH                              0x1
#define _TXB2SIDL_EID17_MASK                                0x2
#define _TXB2SIDL_EXIDE_POSN                                0x3
#define _TXB2SIDL_EXIDE_POSITION                            0x3
#define _TXB2SIDL_EXIDE_SIZE                                0x1
#define _TXB2SIDL_EXIDE_LENGTH                              0x1
#define _TXB2SIDL_EXIDE_MASK                                0x8
#define _TXB2SIDL_SID0_POSN                                 0x5
#define _TXB2SIDL_SID0_POSITION                             0x5
#define _TXB2SIDL_SID0_SIZE                                 0x1
#define _TXB2SIDL_SID0_LENGTH                               0x1
#define _TXB2SIDL_SID0_MASK                                 0x20
#define _TXB2SIDL_SID1_POSN                                 0x6
#define _TXB2SIDL_SID1_POSITION                             0x6
#define _TXB2SIDL_SID1_SIZE                                 0x1
#define _TXB2SIDL_SID1_LENGTH                               0x1
#define _TXB2SIDL_SID1_MASK                                 0x40
#define _TXB2SIDL_SID2_POSN                                 0x7
#define _TXB2SIDL_SID2_POSITION                             0x7
#define _TXB2SIDL_SID2_SIZE                                 0x1
#define _TXB2SIDL_SID2_LENGTH                               0x1
#define _TXB2SIDL_SID2_MASK                                 0x80
#define _TXB2SIDL_TXB2EID16_POSN                            0x0
#define _TXB2SIDL_TXB2EID16_POSITION                        0x0
#define _TXB2SIDL_TXB2EID16_SIZE                            0x1
#define _TXB2SIDL_TXB2EID16_LENGTH                          0x1
#define _TXB2SIDL_TXB2EID16_MASK                            0x1
#define _TXB2SIDL_TXB2EID17_POSN                            0x1
#define _TXB2SIDL_TXB2EID17_POSITION                        0x1
#define _TXB2SIDL_TXB2EID17_SIZE                            0x1
#define _TXB2SIDL_TXB2EID17_LENGTH                          0x1
#define _TXB2SIDL_TXB2EID17_MASK                            0x2
#define _TXB2SIDL_TXB2EXIDE_POSN                            0x3
#define _TXB2SIDL_TXB2EXIDE_POSITION                        0x3
#define _TXB2SIDL_TXB2EXIDE_SIZE                            0x1
#define _TXB2SIDL_TXB2EXIDE_LENGTH                          0x1
#define _TXB2SIDL_TXB2EXIDE_MASK                            0x8
#define _TXB2SIDL_TXB2SID0_POSN                             0x5
#define _TXB2SIDL_TXB2SID0_POSITION                         0x5
#define _TXB2SIDL_TXB2SID0_SIZE                             0x1
#define _TXB2SIDL_TXB2SID0_LENGTH                           0x1
#define _TXB2SIDL_TXB2SID0_MASK                             0x20
#define _TXB2SIDL_TXB2SID1_POSN                             0x6
#define _TXB2SIDL_TXB2SID1_POSITION                         0x6
#define _TXB2SIDL_TXB2SID1_SIZE                             0x1
#define _TXB2SIDL_TXB2SID1_LENGTH                           0x1
#define _TXB2SIDL_TXB2SID1_MASK                             0x40
#define _TXB2SIDL_TXB2SID2_POSN                             0x7
#define _TXB2SIDL_TXB2SID2_POSITION                         0x7
#define _TXB2SIDL_TXB2SID2_SIZE                             0x1
#define _TXB2SIDL_TXB2SID2_LENGTH                           0x1
#define _TXB2SIDL_TXB2SID2_MASK                             0x80

// Register: TXB2EIDH
#define TXB2EIDH TXB2EIDH
extern volatile unsigned char           TXB2EIDH            __at(0xF23);
#ifndef _LIB_BUILD
asm("TXB2EIDH equ 0F23h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned TXB2EID8               :1;
        unsigned TXB2EID9               :1;
        unsigned TXB2EID10              :1;
        unsigned TXB2EID11              :1;
        unsigned TXB2EID12              :1;
        unsigned TXB2EID13              :1;
        unsigned TXB2EID14              :1;
        unsigned TXB2EID15              :1;
    };
} TXB2EIDHbits_t;
extern volatile TXB2EIDHbits_t TXB2EIDHbits __at(0xF23);
// bitfield macros
#define _TXB2EIDH_EID8_POSN                                 0x0
#define _TXB2EIDH_EID8_POSITION                             0x0
#define _TXB2EIDH_EID8_SIZE                                 0x1
#define _TXB2EIDH_EID8_LENGTH                               0x1
#define _TXB2EIDH_EID8_MASK                                 0x1
#define _TXB2EIDH_EID9_POSN                                 0x1
#define _TXB2EIDH_EID9_POSITION                             0x1
#define _TXB2EIDH_EID9_SIZE                                 0x1
#define _TXB2EIDH_EID9_LENGTH                               0x1
#define _TXB2EIDH_EID9_MASK                                 0x2
#define _TXB2EIDH_EID10_POSN                                0x2
#define _TXB2EIDH_EID10_POSITION                            0x2
#define _TXB2EIDH_EID10_SIZE                                0x1
#define _TXB2EIDH_EID10_LENGTH                              0x1
#define _TXB2EIDH_EID10_MASK                                0x4
#define _TXB2EIDH_EID11_POSN                                0x3
#define _TXB2EIDH_EID11_POSITION                            0x3
#define _TXB2EIDH_EID11_SIZE                                0x1
#define _TXB2EIDH_EID11_LENGTH                              0x1
#define _TXB2EIDH_EID11_MASK                                0x8
#define _TXB2EIDH_EID12_POSN                                0x4
#define _TXB2EIDH_EID12_POSITION                            0x4
#define _TXB2EIDH_EID12_SIZE                                0x1
#define _TXB2EIDH_EID12_LENGTH                              0x1
#define _TXB2EIDH_EID12_MASK                                0x10
#define _TXB2EIDH_EID13_POSN                                0x5
#define _TXB2EIDH_EID13_POSITION                            0x5
#define _TXB2EIDH_EID13_SIZE                                0x1
#define _TXB2EIDH_EID13_LENGTH                              0x1
#define _TXB2EIDH_EID13_MASK                                0x20
#define _TXB2EIDH_EID14_POSN                                0x6
#define _TXB2EIDH_EID14_POSITION                            0x6
#define _TXB2EIDH_EID14_SIZE                                0x1
#define _TXB2EIDH_EID14_LENGTH                              0x1
#define _TXB2EIDH_EID14_MASK                                0x40
#define _TXB2EIDH_EID15_POSN                                0x7
#define _TXB2EIDH_EID15_POSITION                            0x7
#define _TXB2EIDH_EID15_SIZE                                0x1
#define _TXB2EIDH_EID15_LENGTH                              0x1
#define _TXB2EIDH_EID15_MASK                                0x80
#define _TXB2EIDH_TXB2EID8_POSN                             0x0
#define _TXB2EIDH_TXB2EID8_POSITION                         0x0
#define _TXB2EIDH_TXB2EID8_SIZE                             0x1
#define _TXB2EIDH_TXB2EID8_LENGTH                           0x1
#define _TXB2EIDH_TXB2EID8_MASK                             0x1
#define _TXB2EIDH_TXB2EID9_POSN                             0x1
#define _TXB2EIDH_TXB2EID9_POSITION                         0x1
#define _TXB2EIDH_TXB2EID9_SIZE                             0x1
#define _TXB2EIDH_TXB2EID9_LENGTH                           0x1
#define _TXB2EIDH_TXB2EID9_MASK                             0x2
#define _TXB2EIDH_TXB2EID10_POSN                            0x2
#define _TXB2EIDH_TXB2EID10_POSITION                        0x2
#define _TXB2EIDH_TXB2EID10_SIZE                            0x1
#define _TXB2EIDH_TXB2EID10_LENGTH                          0x1
#define _TXB2EIDH_TXB2EID10_MASK                            0x4
#define _TXB2EIDH_TXB2EID11_POSN                            0x3
#define _TXB2EIDH_TXB2EID11_POSITION                        0x3
#define _TXB2EIDH_TXB2EID11_SIZE                            0x1
#define _TXB2EIDH_TXB2EID11_LENGTH                          0x1
#define _TXB2EIDH_TXB2EID11_MASK                            0x8
#define _TXB2EIDH_TXB2EID12_POSN                            0x4
#define _TXB2EIDH_TXB2EID12_POSITION                        0x4
#define _TXB2EIDH_TXB2EID12_SIZE                            0x1
#define _TXB2EIDH_TXB2EID12_LENGTH                          0x1
#define _TXB2EIDH_TXB2EID12_MASK                            0x10
#define _TXB2EIDH_TXB2EID13_POSN                            0x5
#define _TXB2EIDH_TXB2EID13_POSITION                        0x5
#define _TXB2EIDH_TXB2EID13_SIZE                            0x1
#define _TXB2EIDH_TXB2EID13_LENGTH                          0x1
#define _TXB2EIDH_TXB2EID13_MASK                            0x20
#define _TXB2EIDH_TXB2EID14_POSN                            0x6
#define _TXB2EIDH_TXB2EID14_POSITION                        0x6
#define _TXB2EIDH_TXB2EID14_SIZE                            0x1
#define _TXB2EIDH_TXB2EID14_LENGTH                          0x1
#define _TXB2EIDH_TXB2EID14_MASK                            0x40
#define _TXB2EIDH_TXB2EID15_POSN                            0x7
#define _TXB2EIDH_TXB2EID15_POSITION                        0x7
#define _TXB2EIDH_TXB2EID15_SIZE                            0x1
#define _TXB2EIDH_TXB2EID15_LENGTH                          0x1
#define _TXB2EIDH_TXB2EID15_MASK                            0x80

// Register: TXB2EIDL
#define TXB2EIDL TXB2EIDL
extern volatile unsigned char           TXB2EIDL            __at(0xF24);
#ifndef _LIB_BUILD
asm("TXB2EIDL equ 0F24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned TXB2EID0               :1;
        unsigned TXB2EID1               :1;
        unsigned TXB2EID2               :1;
        unsigned TXB2EID3               :1;
        unsigned TXB2EID4               :1;
        unsigned TXB2EID5               :1;
        unsigned TXB2EID6               :1;
        unsigned TXB2EID7               :1;
    };
} TXB2EIDLbits_t;
extern volatile TXB2EIDLbits_t TXB2EIDLbits __at(0xF24);
// bitfield macros
#define _TXB2EIDL_EID0_POSN                                 0x0
#define _TXB2EIDL_EID0_POSITION                             0x0
#define _TXB2EIDL_EID0_SIZE                                 0x1
#define _TXB2EIDL_EID0_LENGTH                               0x1
#define _TXB2EIDL_EID0_MASK                                 0x1
#define _TXB2EIDL_EID1_POSN                                 0x1
#define _TXB2EIDL_EID1_POSITION                             0x1
#define _TXB2EIDL_EID1_SIZE                                 0x1
#define _TXB2EIDL_EID1_LENGTH                               0x1
#define _TXB2EIDL_EID1_MASK                                 0x2
#define _TXB2EIDL_EID2_POSN                                 0x2
#define _TXB2EIDL_EID2_POSITION                             0x2
#define _TXB2EIDL_EID2_SIZE                                 0x1
#define _TXB2EIDL_EID2_LENGTH                               0x1
#define _TXB2EIDL_EID2_MASK                                 0x4
#define _TXB2EIDL_EID3_POSN                                 0x3
#define _TXB2EIDL_EID3_POSITION                             0x3
#define _TXB2EIDL_EID3_SIZE                                 0x1
#define _TXB2EIDL_EID3_LENGTH                               0x1
#define _TXB2EIDL_EID3_MASK                                 0x8
#define _TXB2EIDL_EID4_POSN                                 0x4
#define _TXB2EIDL_EID4_POSITION                             0x4
#define _TXB2EIDL_EID4_SIZE                                 0x1
#define _TXB2EIDL_EID4_LENGTH                               0x1
#define _TXB2EIDL_EID4_MASK                                 0x10
#define _TXB2EIDL_EID5_POSN                                 0x5
#define _TXB2EIDL_EID5_POSITION                             0x5
#define _TXB2EIDL_EID5_SIZE                                 0x1
#define _TXB2EIDL_EID5_LENGTH                               0x1
#define _TXB2EIDL_EID5_MASK                                 0x20
#define _TXB2EIDL_EID6_POSN                                 0x6
#define _TXB2EIDL_EID6_POSITION                             0x6
#define _TXB2EIDL_EID6_SIZE                                 0x1
#define _TXB2EIDL_EID6_LENGTH                               0x1
#define _TXB2EIDL_EID6_MASK                                 0x40
#define _TXB2EIDL_EID7_POSN                                 0x7
#define _TXB2EIDL_EID7_POSITION                             0x7
#define _TXB2EIDL_EID7_SIZE                                 0x1
#define _TXB2EIDL_EID7_LENGTH                               0x1
#define _TXB2EIDL_EID7_MASK                                 0x80
#define _TXB2EIDL_TXB2EID0_POSN                             0x0
#define _TXB2EIDL_TXB2EID0_POSITION                         0x0
#define _TXB2EIDL_TXB2EID0_SIZE                             0x1
#define _TXB2EIDL_TXB2EID0_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID0_MASK                             0x1
#define _TXB2EIDL_TXB2EID1_POSN                             0x1
#define _TXB2EIDL_TXB2EID1_POSITION                         0x1
#define _TXB2EIDL_TXB2EID1_SIZE                             0x1
#define _TXB2EIDL_TXB2EID1_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID1_MASK                             0x2
#define _TXB2EIDL_TXB2EID2_POSN                             0x2
#define _TXB2EIDL_TXB2EID2_POSITION                         0x2
#define _TXB2EIDL_TXB2EID2_SIZE                             0x1
#define _TXB2EIDL_TXB2EID2_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID2_MASK                             0x4
#define _TXB2EIDL_TXB2EID3_POSN                             0x3
#define _TXB2EIDL_TXB2EID3_POSITION                         0x3
#define _TXB2EIDL_TXB2EID3_SIZE                             0x1
#define _TXB2EIDL_TXB2EID3_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID3_MASK                             0x8
#define _TXB2EIDL_TXB2EID4_POSN                             0x4
#define _TXB2EIDL_TXB2EID4_POSITION                         0x4
#define _TXB2EIDL_TXB2EID4_SIZE                             0x1
#define _TXB2EIDL_TXB2EID4_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID4_MASK                             0x10
#define _TXB2EIDL_TXB2EID5_POSN                             0x5
#define _TXB2EIDL_TXB2EID5_POSITION                         0x5
#define _TXB2EIDL_TXB2EID5_SIZE                             0x1
#define _TXB2EIDL_TXB2EID5_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID5_MASK                             0x20
#define _TXB2EIDL_TXB2EID6_POSN                             0x6
#define _TXB2EIDL_TXB2EID6_POSITION                         0x6
#define _TXB2EIDL_TXB2EID6_SIZE                             0x1
#define _TXB2EIDL_TXB2EID6_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID6_MASK                             0x40
#define _TXB2EIDL_TXB2EID7_POSN                             0x7
#define _TXB2EIDL_TXB2EID7_POSITION                         0x7
#define _TXB2EIDL_TXB2EID7_SIZE                             0x1
#define _TXB2EIDL_TXB2EID7_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID7_MASK                             0x80

