MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4680/mcu.h
extern volatile TXB1SIDHbits_t TXB1SIDHbits __at(0xF31);
// bitfield macros
#define _TXB1SIDH_SID3_POSN                                 0x0
#define _TXB1SIDH_SID3_POSITION                             0x0
#define _TXB1SIDH_SID3_SIZE                                 0x1
#define _TXB1SIDH_SID3_LENGTH                               0x1
#define _TXB1SIDH_SID3_MASK                                 0x1
#define _TXB1SIDH_SID4_POSN                                 0x1
#define _TXB1SIDH_SID4_POSITION                             0x1
#define _TXB1SIDH_SID4_SIZE                                 0x1
#define _TXB1SIDH_SID4_LENGTH                               0x1
#define _TXB1SIDH_SID4_MASK                                 0x2
#define _TXB1SIDH_SID5_POSN                                 0x2
#define _TXB1SIDH_SID5_POSITION                             0x2
#define _TXB1SIDH_SID5_SIZE                                 0x1
#define _TXB1SIDH_SID5_LENGTH                               0x1
#define _TXB1SIDH_SID5_MASK                                 0x4
#define _TXB1SIDH_SID6_POSN                                 0x3
#define _TXB1SIDH_SID6_POSITION                             0x3
#define _TXB1SIDH_SID6_SIZE                                 0x1
#define _TXB1SIDH_SID6_LENGTH                               0x1
#define _TXB1SIDH_SID6_MASK                                 0x8
#define _TXB1SIDH_SID7_POSN                                 0x4
#define _TXB1SIDH_SID7_POSITION                             0x4
#define _TXB1SIDH_SID7_SIZE                                 0x1
#define _TXB1SIDH_SID7_LENGTH                               0x1
#define _TXB1SIDH_SID7_MASK                                 0x10
#define _TXB1SIDH_SID8_POSN                                 0x5
#define _TXB1SIDH_SID8_POSITION                             0x5
#define _TXB1SIDH_SID8_SIZE                                 0x1
#define _TXB1SIDH_SID8_LENGTH                               0x1
#define _TXB1SIDH_SID8_MASK                                 0x20
#define _TXB1SIDH_SID9_POSN                                 0x6
#define _TXB1SIDH_SID9_POSITION                             0x6
#define _TXB1SIDH_SID9_SIZE                                 0x1
#define _TXB1SIDH_SID9_LENGTH                               0x1
#define _TXB1SIDH_SID9_MASK                                 0x40
#define _TXB1SIDH_SID10_POSN                                0x7
#define _TXB1SIDH_SID10_POSITION                            0x7
#define _TXB1SIDH_SID10_SIZE                                0x1
#define _TXB1SIDH_SID10_LENGTH                              0x1
#define _TXB1SIDH_SID10_MASK                                0x80
#define _TXB1SIDH_TXB1SID3_POSN                             0x0
#define _TXB1SIDH_TXB1SID3_POSITION                         0x0
#define _TXB1SIDH_TXB1SID3_SIZE                             0x1
#define _TXB1SIDH_TXB1SID3_LENGTH                           0x1
#define _TXB1SIDH_TXB1SID3_MASK                             0x1
#define _TXB1SIDH_TXB1SID4_POSN                             0x1
#define _TXB1SIDH_TXB1SID4_POSITION                         0x1
#define _TXB1SIDH_TXB1SID4_SIZE                             0x1
#define _TXB1SIDH_TXB1SID4_LENGTH                           0x1
#define _TXB1SIDH_TXB1SID4_MASK                             0x2
#define _TXB1SIDH_TXB1SID5_POSN                             0x2
#define _TXB1SIDH_TXB1SID5_POSITION                         0x2
#define _TXB1SIDH_TXB1SID5_SIZE                             0x1
#define _TXB1SIDH_TXB1SID5_LENGTH                           0x1
#define _TXB1SIDH_TXB1SID5_MASK                             0x4
#define _TXB1SIDH_TXB1SID6_POSN                             0x3
#define _TXB1SIDH_TXB1SID6_POSITION                         0x3
#define _TXB1SIDH_TXB1SID6_SIZE                             0x1
#define _TXB1SIDH_TXB1SID6_LENGTH                           0x1
#define _TXB1SIDH_TXB1SID6_MASK                             0x8
#define _TXB1SIDH_TXB1SID7_POSN                             0x4
#define _TXB1SIDH_TXB1SID7_POSITION                         0x4
#define _TXB1SIDH_TXB1SID7_SIZE                             0x1
#define _TXB1SIDH_TXB1SID7_LENGTH                           0x1
#define _TXB1SIDH_TXB1SID7_MASK                             0x10
#define _TXB1SIDH_TXB1SID8_POSN                             0x5
#define _TXB1SIDH_TXB1SID8_POSITION                         0x5
#define _TXB1SIDH_TXB1SID8_SIZE                             0x1
#define _TXB1SIDH_TXB1SID8_LENGTH                           0x1
#define _TXB1SIDH_TXB1SID8_MASK                             0x20
#define _TXB1SIDH_TXB1SID9_POSN                             0x6
#define _TXB1SIDH_TXB1SID9_POSITION                         0x6
#define _TXB1SIDH_TXB1SID9_SIZE                             0x1
#define _TXB1SIDH_TXB1SID9_LENGTH                           0x1
#define _TXB1SIDH_TXB1SID9_MASK                             0x40
#define _TXB1SIDH_TXB1SID10_POSN                            0x7
#define _TXB1SIDH_TXB1SID10_POSITION                        0x7
#define _TXB1SIDH_TXB1SID10_SIZE                            0x1
#define _TXB1SIDH_TXB1SID10_LENGTH                          0x1
#define _TXB1SIDH_TXB1SID10_MASK                            0x80

// Register: TXB1SIDL
#define TXB1SIDL TXB1SIDL
extern volatile unsigned char           TXB1SIDL            __at(0xF32);
#ifndef _LIB_BUILD
asm("TXB1SIDL equ 0F32h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDE                  :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned TXB1EID16              :1;
        unsigned TXB1EID17              :1;
        unsigned                        :1;
        unsigned TXB1EXIDE              :1;
        unsigned                        :1;
        unsigned TXB1SID0               :1;
        unsigned TXB1SID1               :1;
        unsigned TXB1SID2               :1;
    };
} TXB1SIDLbits_t;
extern volatile TXB1SIDLbits_t TXB1SIDLbits __at(0xF32);
// bitfield macros
#define _TXB1SIDL_EID16_POSN                                0x0
#define _TXB1SIDL_EID16_POSITION                            0x0
#define _TXB1SIDL_EID16_SIZE                                0x1
#define _TXB1SIDL_EID16_LENGTH                              0x1
#define _TXB1SIDL_EID16_MASK                                0x1
#define _TXB1SIDL_EID17_POSN                                0x1
#define _TXB1SIDL_EID17_POSITION                            0x1
#define _TXB1SIDL_EID17_SIZE                                0x1
#define _TXB1SIDL_EID17_LENGTH                              0x1
#define _TXB1SIDL_EID17_MASK                                0x2
#define _TXB1SIDL_EXIDE_POSN                                0x3
#define _TXB1SIDL_EXIDE_POSITION                            0x3
#define _TXB1SIDL_EXIDE_SIZE                                0x1
#define _TXB1SIDL_EXIDE_LENGTH                              0x1
#define _TXB1SIDL_EXIDE_MASK                                0x8
#define _TXB1SIDL_SID0_POSN                                 0x5
#define _TXB1SIDL_SID0_POSITION                             0x5
#define _TXB1SIDL_SID0_SIZE                                 0x1
#define _TXB1SIDL_SID0_LENGTH                               0x1
#define _TXB1SIDL_SID0_MASK                                 0x20
#define _TXB1SIDL_SID1_POSN                                 0x6
#define _TXB1SIDL_SID1_POSITION                             0x6
#define _TXB1SIDL_SID1_SIZE                                 0x1
#define _TXB1SIDL_SID1_LENGTH                               0x1
#define _TXB1SIDL_SID1_MASK                                 0x40
#define _TXB1SIDL_SID2_POSN                                 0x7
#define _TXB1SIDL_SID2_POSITION                             0x7
#define _TXB1SIDL_SID2_SIZE                                 0x1
#define _TXB1SIDL_SID2_LENGTH                               0x1
#define _TXB1SIDL_SID2_MASK                                 0x80
#define _TXB1SIDL_TXB1EID16_POSN                            0x0
#define _TXB1SIDL_TXB1EID16_POSITION                        0x0
#define _TXB1SIDL_TXB1EID16_SIZE                            0x1
#define _TXB1SIDL_TXB1EID16_LENGTH                          0x1
#define _TXB1SIDL_TXB1EID16_MASK                            0x1
#define _TXB1SIDL_TXB1EID17_POSN                            0x1
#define _TXB1SIDL_TXB1EID17_POSITION                        0x1
#define _TXB1SIDL_TXB1EID17_SIZE                            0x1
#define _TXB1SIDL_TXB1EID17_LENGTH                          0x1
#define _TXB1SIDL_TXB1EID17_MASK                            0x2
#define _TXB1SIDL_TXB1EXIDE_POSN                            0x3
#define _TXB1SIDL_TXB1EXIDE_POSITION                        0x3
#define _TXB1SIDL_TXB1EXIDE_SIZE                            0x1
#define _TXB1SIDL_TXB1EXIDE_LENGTH                          0x1
#define _TXB1SIDL_TXB1EXIDE_MASK                            0x8
#define _TXB1SIDL_TXB1SID0_POSN                             0x5
#define _TXB1SIDL_TXB1SID0_POSITION                         0x5
#define _TXB1SIDL_TXB1SID0_SIZE                             0x1
#define _TXB1SIDL_TXB1SID0_LENGTH                           0x1
#define _TXB1SIDL_TXB1SID0_MASK                             0x20
#define _TXB1SIDL_TXB1SID1_POSN                             0x6
#define _TXB1SIDL_TXB1SID1_POSITION                         0x6
#define _TXB1SIDL_TXB1SID1_SIZE                             0x1
#define _TXB1SIDL_TXB1SID1_LENGTH                           0x1
#define _TXB1SIDL_TXB1SID1_MASK                             0x40
#define _TXB1SIDL_TXB1SID2_POSN                             0x7
#define _TXB1SIDL_TXB1SID2_POSITION                         0x7
#define _TXB1SIDL_TXB1SID2_SIZE                             0x1
#define _TXB1SIDL_TXB1SID2_LENGTH                           0x1
#define _TXB1SIDL_TXB1SID2_MASK                             0x80

// Register: TXB1EIDH
#define TXB1EIDH TXB1EIDH
extern volatile unsigned char           TXB1EIDH            __at(0xF33);
#ifndef _LIB_BUILD
asm("TXB1EIDH equ 0F33h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned TXB1EID8               :1;
        unsigned TXB1EID9               :1;
        unsigned TXB1EID10              :1;
        unsigned TXB1EID11              :1;
        unsigned TXB1EID12              :1;
        unsigned TXB1EID13              :1;
        unsigned TXB1EID14              :1;
        unsigned TXB1EID15              :1;
    };
} TXB1EIDHbits_t;
